OdRxValueType.equalTo(System.Void!System.Runtime.CompilerServices.IsConst*,System.Void!System.Runtime.CompilerServices.IsConst*)
\details
Compares two values of the underlying C++ type.
\param a [in] First value to compare.
\param b [in] Second value to compare.
\returns
True if compared values are equal; false otherwise.

OdRxValueType.toString(System.Void!System.Runtime.CompilerServices.IsConst*,OdRxValueType.StringFormat)
\details
Convert value to string.
\param instance [in] Instance of the value to convert.
\param format   [in] Defines the format of the resulting string.
\returns
Converted value.
\remarks
Mostly for debug purposes.

OdRxValueType.fromValueType(OdRxValue!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdRxValue*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Convert value from the specified type (type of the "from" value) to this
type.
\param from      [in] Value of type to convert from.
\param instance [out] Resulting value of "this" type.
\returns
True if conversion is possible. False otherwise.

OdRxValueType.toValueType(OdRxValueType!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdRxValue!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdRxValue*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Convert value to the specified type from this type.
\param vt       [in] Type to convert to.
\param instance [in] Value of "this" type.
\param result  [out] Resulting value of the type specified in vt.
\returns
True if conversion is possible. False otherwise.

OdRxValueType.create
\details
Create new OdRxValue of this type, wrapped in OdRxBoxedValue (if you need a
smart pointer).
\returns
Created OdRxBoxedValue object containing an OdRxValue object of this type.

OdRxValueType.createValue
\details
Create a new wrapped value of this type.
\returns
Created wrapped value of this type.

OdRxValueType.isAggregate
\details
Indicates whether the value type is SDAI aggregate data type.
\returns
True for SDAI aggregate data type. False for other value types.

OdRxValueType.isSelect
\details
Indicates whether the value type is SDAI select data type.
\returns
True for SDAI select data type. False for other value types.

OdRxValueType.isReference
\details
Indicates whether the value type is handler.
\returns
True for object handlers value types, like OdDbObjectId. False for other
value types.

OdRxValueType.isEnum
\details
Indicates whether the value type is enumeration.
\returns
True for the enumerations. False for other types.

OdRxValueType.isBlittable
\details
Indicates whether the value type is blittable.
\returns
True for the POD types (value may be copied by memcpy). False for other types.

OdRxValueType.op_Inequality(OdRxValueType!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Negative comparison operator.
\param rhs [in] Value type to compare with the current value type.
\returns
True if value types are not equal; false otherwise.

OdRxValueType.op_Equality(OdRxValueType!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Comparison operator.
\param rhs [in] Value type to compare with the current value type.
\returns
True if value types are equal; false otherwise.

OdRxValueType.Dispose
\details
Destructor for objects of the OdRxValueType class.